; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=288, out_folder=htg/blocksworld/training, instance_id=56, seed=2080, goal_proportion=0.03

(define (problem blocksworld-56)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 - object)
 (:init 
    (arm-empty)
    (clear b88)
    (on b88 b141)
    (on b141 b248)
    (on b248 b241)
    (on b241 b285)
    (on b285 b242)
    (on b242 b35)
    (on b35 b97)
    (on b97 b183)
    (on-table b183)
    (clear b95)
    (on b95 b236)
    (on-table b236)
    (clear b194)
    (on b194 b217)
    (on b217 b284)
    (on b284 b195)
    (on b195 b12)
    (on-table b12)
    (clear b246)
    (on b246 b46)
    (on b46 b256)
    (on-table b256)
    (clear b173)
    (on b173 b67)
    (on-table b67)
    (clear b32)
    (on b32 b93)
    (on b93 b154)
    (on b154 b11)
    (on b11 b127)
    (on b127 b36)
    (on b36 b130)
    (on-table b130)
    (clear b190)
    (on b190 b71)
    (on b71 b19)
    (on b19 b16)
    (on b16 b123)
    (on b123 b227)
    (on b227 b197)
    (on b197 b120)
    (on b120 b196)
    (on-table b196)
    (clear b73)
    (on-table b73)
    (clear b286)
    (on b286 b160)
    (on b160 b129)
    (on b129 b94)
    (on-table b94)
    (clear b101)
    (on b101 b259)
    (on-table b259)
    (clear b49)
    (on-table b49)
    (clear b156)
    (on b156 b52)
    (on b52 b231)
    (on b231 b100)
    (on-table b100)
    (clear b7)
    (on b7 b128)
    (on-table b128)
    (clear b38)
    (on-table b38)
    (clear b276)
    (on b276 b87)
    (on b87 b250)
    (on-table b250)
    (clear b126)
    (on b126 b182)
    (on b182 b117)
    (on-table b117)
    (clear b189)
    (on b189 b207)
    (on-table b207)
    (clear b28)
    (on b28 b174)
    (on b174 b26)
    (on-table b26)
    (clear b9)
    (on-table b9)
    (clear b252)
    (on b252 b62)
    (on b62 b202)
    (on-table b202)
    (clear b132)
    (on b132 b53)
    (on b53 b15)
    (on b15 b4)
    (on-table b4)
    (clear b96)
    (on-table b96)
    (clear b228)
    (on-table b228)
    (clear b257)
    (on b257 b1)
    (on b1 b191)
    (on b191 b209)
    (on b209 b14)
    (on b14 b283)
    (on b283 b77)
    (on b77 b118)
    (on b118 b206)
    (on b206 b56)
    (on b56 b260)
    (on b260 b176)
    (on b176 b131)
    (on b131 b220)
    (on b220 b78)
    (on-table b78)
    (clear b70)
    (on b70 b125)
    (on b125 b264)
    (on b264 b254)
    (on b254 b271)
    (on b271 b268)
    (on b268 b75)
    (on b75 b186)
    (on b186 b80)
    (on-table b80)
    (clear b68)
    (on-table b68)
    (clear b109)
    (on b109 b92)
    (on-table b92)
    (clear b59)
    (on b59 b76)
    (on-table b76)
    (clear b140)
    (on-table b140)
    (clear b137)
    (on-table b137)
    (clear b199)
    (on b199 b27)
    (on b27 b107)
    (on b107 b188)
    (on-table b188)
    (clear b165)
    (on b165 b81)
    (on-table b81)
    (clear b54)
    (on b54 b121)
    (on b121 b139)
    (on-table b139)
    (clear b172)
    (on b172 b281)
    (on b281 b2)
    (on b2 b55)
    (on b55 b106)
    (on b106 b166)
    (on b166 b224)
    (on-table b224)
    (clear b98)
    (on b98 b64)
    (on b64 b269)
    (on b269 b158)
    (on-table b158)
    (clear b34)
    (on b34 b135)
    (on b135 b90)
    (on-table b90)
    (clear b136)
    (on b136 b142)
    (on b142 b167)
    (on b167 b221)
    (on b221 b50)
    (on b50 b274)
    (on b274 b212)
    (on b212 b245)
    (on b245 b25)
    (on b25 b30)
    (on b30 b143)
    (on b143 b60)
    (on-table b60)
    (clear b150)
    (on b150 b218)
    (on b218 b10)
    (on-table b10)
    (clear b124)
    (on b124 b65)
    (on-table b65)
    (clear b163)
    (on b163 b45)
    (on-table b45)
    (clear b243)
    (on b243 b51)
    (on b51 b155)
    (on b155 b213)
    (on-table b213)
    (clear b152)
    (on b152 b66)
    (on b66 b275)
    (on b275 b267)
    (on b267 b153)
    (on-table b153)
    (clear b280)
    (on b280 b200)
    (on-table b200)
    (clear b178)
    (on b178 b103)
    (on b103 b3)
    (on b3 b233)
    (on-table b233)
    (clear b91)
    (on b91 b239)
    (on b239 b144)
    (on b144 b262)
    (on b262 b203)
    (on b203 b43)
    (on b43 b39)
    (on-table b39)
    (clear b23)
    (on-table b23)
    (clear b287)
    (on-table b287)
    (clear b31)
    (on b31 b47)
    (on-table b47)
    (clear b270)
    (on b270 b266)
    (on b266 b61)
    (on b61 b83)
    (on b83 b171)
    (on b171 b48)
    (on b48 b193)
    (on b193 b185)
    (on b185 b226)
    (on b226 b69)
    (on b69 b18)
    (on-table b18)
    (clear b63)
    (on b63 b84)
    (on b84 b20)
    (on b20 b5)
    (on b5 b184)
    (on-table b184)
    (clear b180)
    (on b180 b225)
    (on b225 b112)
    (on b112 b17)
    (on b17 b37)
    (on b37 b204)
    (on b204 b237)
    (on b237 b116)
    (on b116 b148)
    (on b148 b169)
    (on b169 b258)
    (on-table b258)
    (clear b232)
    (on b232 b24)
    (on b24 b29)
    (on-table b29)
    (clear b115)
    (on b115 b181)
    (on b181 b253)
    (on b253 b235)
    (on b235 b273)
    (on b273 b8)
    (on-table b8)
    (clear b159)
    (on b159 b187)
    (on-table b187)
    (clear b277)
    (on b277 b230)
    (on b230 b74)
    (on b74 b85)
    (on-table b85)
    (clear b157)
    (on b157 b265)
    (on b265 b272)
    (on b272 b57)
    (on b57 b234)
    (on b234 b22)
    (on b22 b244)
    (on b244 b40)
    (on b40 b110)
    (on b110 b114)
    (on b114 b138)
    (on b138 b145)
    (on-table b145)
    (clear b177)
    (on b177 b134)
    (on b134 b261)
    (on b261 b42)
    (on-table b42)
    (clear b102)
    (on b102 b99)
    (on b99 b179)
    (on b179 b255)
    (on b255 b198)
    (on b198 b282)
    (on b282 b288)
    (on b288 b201)
    (on b201 b44)
    (on b44 b175)
    (on-table b175)
    (clear b79)
    (on-table b79)
    (clear b222)
    (on b222 b111)
    (on b111 b82)
    (on-table b82)
    (clear b146)
    (on-table b146)
    (clear b164)
    (on-table b164)
    (clear b249)
    (on b249 b263)
    (on b263 b240)
    (on b240 b41)
    (on-table b41)
    (clear b251)
    (on b251 b219)
    (on-table b219)
    (clear b147)
    (on-table b147)
    (clear b122)
    (on b122 b205)
    (on b205 b215)
    (on b215 b113)
    (on b113 b58)
    (on-table b58)
    (clear b151)
    (on-table b151)
    (clear b168)
    (on b168 b229)
    (on b229 b13)
    (on-table b13)
    (clear b170)
    (on b170 b33)
    (on b33 b278)
    (on b278 b108)
    (on-table b108)
    (clear b6)
    (on b6 b192)
    (on-table b192)
    (clear b216)
    (on b216 b89)
    (on b89 b279)
    (on-table b279)
    (clear b133)
    (on b133 b162)
    (on b162 b104)
    (on b104 b210)
    (on-table b210)
    (clear b211)
    (on b211 b105)
    (on b105 b149)
    (on b149 b72)
    (on-table b72)
    (clear b119)
    (on b119 b238)
    (on b238 b223)
    (on b223 b86)
    (on b86 b161)
    (on b161 b247)
    (on b247 b214)
    (on b214 b208)
    (on-table b208)
    (clear b21)
    (on-table b21))
 (:goal  (and 
    (clear b5)
    (on b5 b1)
    (on b1 b4)
    (on b4 b6)
    (on b6 b7)
    (on b7 b2)
    (on b2 b8)
    (on b8 b3)
    (on-table b3))))

; plan
1. (unstack b115 b181)
   deleted: (on b115 b181) (clear b115) (arm-empty)
   added: (holding b115) (clear b181)
   goals met: 0 of 9
2. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 0 of 9
3. (unstack b132 b53)
   deleted: (on b132 b53) (clear b132) (arm-empty)
   added: (holding b132) (clear b53)
   goals met: 0 of 9
4. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 0 of 9
5. (unstack b172 b281)
   deleted: (on b172 b281) (clear b172) (arm-empty)
   added: (holding b172) (clear b281)
   goals met: 0 of 9
6. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 0 of 9
7. (unstack b178 b103)
   deleted: (on b178 b103) (clear b178) (arm-empty)
   added: (holding b178) (clear b103)
   goals met: 0 of 9
8. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 0 of 9
9. (unstack b103 b3)
   deleted: (on b103 b3) (clear b103) (arm-empty)
   added: (holding b103) (clear b3)
   goals met: 0 of 9
10. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 0 of 9
11. (unstack b3 b233)
   deleted: (on b3 b233) (clear b3) (arm-empty)
   added: (holding b3) (clear b233)
   goals met: 0 of 9
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 9
13. (unstack b181 b253)
   deleted: (on b181 b253) (clear b181) (arm-empty)
   added: (holding b181) (clear b253)
   goals met: 1 of 9
14. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 1 of 9
15. (unstack b253 b235)
   deleted: (on b253 b235) (clear b253) (arm-empty)
   added: (holding b253) (clear b235)
   goals met: 1 of 9
16. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 1 of 9
17. (unstack b235 b273)
   deleted: (on b235 b273) (clear b235) (arm-empty)
   added: (holding b235) (clear b273)
   goals met: 1 of 9
18. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 1 of 9
19. (unstack b257 b1)
   deleted: (on b257 b1) (clear b257) (arm-empty)
   added: (holding b257) (clear b1)
   goals met: 1 of 9
20. (putdown b257)
   deleted: (holding b257)
   added: (clear b257) (arm-empty) (on-table b257)
   goals met: 1 of 9
21. (unstack b273 b8)
   deleted: (on b273 b8) (clear b273) (arm-empty)
   added: (holding b273) (clear b8)
   goals met: 1 of 9
22. (putdown b273)
   deleted: (holding b273)
   added: (clear b273) (arm-empty) (on-table b273)
   goals met: 1 of 9
23. (unstack b281 b2)
   deleted: (on b281 b2) (clear b281) (arm-empty)
   added: (holding b281) (clear b2)
   goals met: 1 of 9
24. (putdown b281)
   deleted: (holding b281)
   added: (clear b281) (arm-empty) (on-table b281)
   goals met: 1 of 9
25. (unstack b53 b15)
   deleted: (on b53 b15) (clear b53) (arm-empty)
   added: (holding b53) (clear b15)
   goals met: 1 of 9
26. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 1 of 9
27. (unstack b15 b4)
   deleted: (on b15 b4) (clear b15) (arm-empty)
   added: (holding b15) (clear b4)
   goals met: 1 of 9
28. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 9
29. (unstack b63 b84)
   deleted: (on b63 b84) (clear b63) (arm-empty)
   added: (holding b63) (clear b84)
   goals met: 1 of 9
30. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 1 of 9
31. (unstack b84 b20)
   deleted: (on b84 b20) (clear b84) (arm-empty)
   added: (holding b84) (clear b20)
   goals met: 1 of 9
32. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 1 of 9
33. (unstack b20 b5)
   deleted: (on b20 b5) (clear b20) (arm-empty)
   added: (holding b20) (clear b5)
   goals met: 2 of 9
34. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 9
35. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 2 of 9
36. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 3 of 9
37. (unstack b2 b55)
   deleted: (on b2 b55) (clear b2) (arm-empty)
   added: (holding b2) (clear b55)
   goals met: 3 of 9
38. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 4 of 9
39. (unstack b7 b128)
   deleted: (on b7 b128) (clear b7) (arm-empty)
   added: (holding b7) (clear b128)
   goals met: 4 of 9
40. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 5 of 9
41. (unstack b6 b192)
   deleted: (on b6 b192) (clear b6) (arm-empty)
   added: (holding b6) (clear b192)
   goals met: 5 of 9
42. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 6 of 9
43. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 9
44. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 7 of 9
45. (unstack b1 b191)
   deleted: (on b1 b191) (clear b1) (arm-empty)
   added: (holding b1) (clear b191)
   goals met: 7 of 9
46. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 8 of 9
47. (unstack b5 b184)
   deleted: (on b5 b184) (clear b5) (arm-empty)
   added: (holding b5) (clear b184)
   goals met: 7 of 9
48. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 9 of 9
